# Challenge 1

In [18]:
import sqlalchemy as db
from getpass import getpass

In [2]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [3]:
dbName = "publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [4]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [19]:
import pandas as pd

In [20]:
#STEP 1

df = pd.read_sql_query("""

SELECT t.title_id AS "TITLE" , tta.au_id "AUTHOR ID", round(t.price * s.qty * t.royalty / 100 * tta.royaltyper / 100,2) AS "SALES_ROYALTY"
    
    FROM titles AS t 
    INNER JOIN titleauthor AS tta
    ON  t.title_id = tta.title_id
    INNER JOIN authors AS au
    ON tta.au_id = au.au_id
    INNER JOIN sales as s
    ON t.title_id=s.title_id
    
""", engine)

In [21]:
df.head()

    TITLE    AUTHOR ID  SALES_ROYALTY
0  BU1032  213-46-8915           4.00
1  BU1032  409-56-7008           6.00
2  PS2091  899-46-2035           1.97
3  PS2091  998-72-3567           1.97
4  PC8888  427-17-2319          50.00

In [22]:
#temporary table 1

In [ ]:
#STEP 2: 

"""

CREATE TEMPORARY TABLE s2(
SELECT s1.title_id,s1.au_id,round(sum(SALES_ROYALTY),2)
FROM s1
GROUP BY s1.title_id,s1.au_id
);
    
"""

In [26]:
#STEP 3

In [ ]:
df = pd.read_sql_query("""

SELECT s2.au_id, ROUND(sum(t.advance+t.royalty),2) AS royalty
FROM s2
INNER JOIN titles AS t 
ON t.title_id = tta.title_id
INNER JOIN titleauthor AS tta
ON  t.title_id = tta.title_id
ORDER BY royalty DESC limit 3
    
""", engine)

# Challenge 2

In [ ]:
df = pd.read_sql_query("""

SELECT s1.title AS "TITLE" ,s1.au_id "AUTHOR ID",sum(s1.SR) AS "Aggregated royalties"

FROM (
	SELECT t.title_id AS "TITLE" , tta.au_id "AUTHOR ID", round(t.price * s.qty * t.royalty / 100 * tta.royaltyper / 100,3) AS "SR"
		FROM titles AS t 
		INNER JOIN titleauthor AS tta
		ON  t.title_id = tta.title_id
		INNER JOIN authors AS au
		ON tta.au_id = au.au_id
        INNER JOIN sales as s
		ON t.title_id=s.title_id
        )
        AS s1
        
ORDER BY s1.au_id, s1.title_id
         
""", engine)

# Challenge 3